// Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.

void Dlina (int  a)
{
string num = a.ToString();
Console.WriteLine(num.Length);
}
Dlina(478);